In [63]:
%load_ext sql
%sql mysql://root:#MySQL/rivage67@localhost/mydb

In [64]:
%%sql
USE mydb;

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

In [76]:
%%sql
SHOW FULL TABLES;

 * mysql://root:***@localhost/mydb
   mysql://root:***@localhost/sakila
12 rows affected.

[('customer', 'BASE TABLE'),
 ('dessert', 'BASE TABLE'),
 ('discount', 'BASE TABLE'),
 ('drink', 'BASE TABLE'),
 ('driver', 'BASE TABLE'),
 ('ingredient', 'BASE TABLE'),
 ('ingredient_pizza', 'BASE TABLE'),
 ('menu', 'BASE TABLE'),
 ('menu_order', 'BASE TABLE'),
 ('order', 'BASE TABLE'),
 ('password', 'BASE TABLE'),
 ('pizza', 'BASE TABLE')]

In [67]:
%%sql
INSERT INTO menu(idMenu) VALUES ('4 cheese');
INSERT INTO menu(idMenu) VALUES ('forbigboys');
INSERT INTO menu(idMenu) VALUES ('hawai');
INSERT INTO menu(idMenu) VALUES ('la jounaid');
INSERT INTO menu(idMenu) VALUES ('la laurent');
INSERT INTO menu(idMenu) VALUES ('marguerita');
INSERT INTO menu(idMenu) VALUES ('mexican');
INSERT INTO menu(idMenu) VALUES ('Summer Pizza');
INSERT INTO menu(idMenu) VALUES ('the special');
INSERT INTO menu(idMenu) VALUES ('Winter edition');

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [68]:
%%sql
SELECT * FROM menu;

 * mysql://root:***@localhost/mydb
10 rows affected.

[('4 cheese',),
 ('forbigboys',),
 ('hawai',),
 ('la jounaid',),
 ('la laurent',),
 ('marguerita',),
 ('mexican',),
 ('Summer Pizza',),
 ('the special',),
 ('Winter edition',)]

In [82]:
%%sql
INSERT INTO pizza(idPizza) VALUES ('4 cheese');
INSERT INTO pizza(idPizza) VALUES ('forbigboys');
INSERT INTO pizza(idPizza) VALUES ('hawai');
INSERT INTO pizza(idPizza) VALUES ('la jounaid');
INSERT INTO pizza(idPizza) VALUES ('la laurent');
INSERT INTO pizza(idPizza) VALUES ('marguerita');
INSERT INTO pizza(idPizza) VALUES ('mexican');
INSERT INTO pizza(idPizza) VALUES ('Summer Pizza');
INSERT INTO pizza(idPizza) VALUES ('the special');
INSERT INTO pizza(idPizza) VALUES ('Winter edition');

 * mysql://root:***@localhost/mydb
   mysql://root:***@localhost/sakila
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [66]:
%%sql
SELECT * FROM pizza;

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

In [84]:
%%sql
INSERT INTO ingredient(idIngredient,price) VALUES ('tomato sauce',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('tomatos',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('onion',0.50);
INSERT INTO ingredient(idIngredient,price) VALUES ('pineapple',0.50);
INSERT INTO ingredient(idIngredient,price) VALUES ('curry leaves',0.50);
INSERT INTO ingredient(idIngredient,price) VALUES ('coriander',0.50);
INSERT INTO ingredient(idIngredient,price) VALUES ('cream',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('olives',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('mozzarela',2.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('blue cheese',2.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('garlic',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('sausages',3.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('ketchup',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('beef',5.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('gouda',3.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('spinach',1.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('pizza dough',3.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('emmental',2.00);
INSERT INTO ingredient(idIngredient,price) VALUES ('anchovy',9.00);

 * mysql://root:***@localhost/mydb
   mysql://root:***@localhost/sakila
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [85]:
%%sql
SELECT * FROM ingredient;

 * mysql://root:***@localhost/mydb
   mysql://root:***@localhost/sakila
19 rows affected.

[('anchovy', Decimal('9.00')),
 ('beef', Decimal('5.00')),
 ('blue cheese', Decimal('2.00')),
 ('coriander', Decimal('0.50')),
 ('cream', Decimal('1.00')),
 ('curry leaves', Decimal('0.50')),
 ('emmental', Decimal('2.00')),
 ('garlic', Decimal('1.00')),
 ('gouda', Decimal('3.00')),
 ('ketchup', Decimal('1.00')),
 ('mozzarela', Decimal('2.00')),
 ('olives', Decimal('1.00')),
 ('onion', Decimal('0.50')),
 ('pineapple', Decimal('0.50')),
 ('pizza dough', Decimal('3.00')),
 ('sausages', Decimal('3.00')),
 ('spinach', Decimal('1.00')),
 ('tomato sauce', Decimal('1.00')),
 ('tomatos', Decimal('1.00'))]

In [88]:
%%sql
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('4 cheese','pizza dough');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('4 cheese','tomato sauce');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('4 cheese','mozzarela');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('4 cheese','gouda');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('4 cheese','blue cheese');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('4 cheese','emmental');

INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','pizza dough');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','tomato sauce');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','beef');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','cream');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','olives');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','sausages');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('forbigboys','spinach');

INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('la jounaid','pizza dough');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('la jounaid','tomato sauce');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('la jounaid','olives');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('la jounaid','anchovy');
INSERT INTO ingredient_pizza(idPizza,idIngredient) VALUES ('la jounaid','gouda');

 * mysql://root:***@localhost/mydb
   mysql://root:***@localhost/sakila
1 rows affected.
2 rows affected.

[]

In [92]:
%%sql
SELECT * FROM ingredient_pizza;

 * mysql://root:***@localhost/mydb
   mysql://root:***@localhost/sakila
17 rows affected.

[('la jounaid', 'anchovy'),
 ('forbigboys', 'beef'),
 ('4 cheese', 'blue cheese'),
 ('forbigboys', 'cream'),
 ('4 cheese', 'emmental'),
 ('4 cheese', 'gouda'),
 ('la jounaid', 'gouda'),
 ('4 cheese', 'mozzarela'),
 ('forbigboys', 'olives'),
 ('la jounaid', 'olives'),
 ('4 cheese', 'pizza dough'),
 ('forbigboys', 'pizza dough'),
 ('la jounaid', 'pizza dough'),
 ('forbigboys', 'sausages'),
 ('4 cheese', 'tomato sauce'),
 ('forbigboys', 'tomato sauce'),
 ('la jounaid', 'tomato sauce')]

In [24]:
def menu_price_pizza(idMenu):
     	SELECT * FROM ingredient_pizza WHERE idPizza = idMenu;

menu_price_pizza("la jounaid")

SyntaxError: invalid syntax (4035462495.py, line 2)

In [32]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [21]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection
connection = create_server_connection("127.0.0.1", "root", "#MySQL/rivage67")

MySQL Database connection successful

In [69]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")
        
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")
        
menu = """
SELECT idMenu
FROM menu;
"""

connection = create_db_connection("127.0.0.1", "root", "#MySQL/rivage67", "mydb")
results = read_query(connection, menu)

for result in results:
    print(result)

#connection = create_db_connection("127.0.0.1", "root", "#MySQL/rivage67", "mydb") # Connect to the Database
#execute_query(connection, menu) # Execute our defined query

MySQL Database connection successful
yo
[('4 cheese',), ('forbigboys',), ('hawai',), ('la jounaid',), ('la laurent',), ('marguerita',), ('mexican',), ('Summer Pizza',), ('the special',), ('Winter edition',)]
('4 cheese',)
('forbigboys',)
('hawai',)
('la jounaid',)
('la laurent',)
('marguerita',)
('mexican',)
('Summer Pizza',)
('the special',)
('Winter edition',)